# -*- coding: utf-8 -*-
# Wikipedia SandBox から テキスト情報を色々抽出するスクリプト
import sys
import urllib2
import json as js
import re


class Wiki():
    def __init__(self):
        self.url = "http://ja.wikipedia.org/w/api.php?"
        self.query = "メインページ"
        self.param = "action=query&prop=revisions&format=json&rvprop=content&rvlimit=1&titles=%s&redirects=" % (
        urllib2.quote(self.query))

    def set_query(self, query):
        self.query = query
        self.param = "action=query&prop=revisions&format=json&rvprop=content&rvlimit=1&titles=%s&redirects=" % (
        urllib2.quote(self.query))

    def get_content(self):
        res = urllib2.urlopen(self.url + self.param)
        json = js.loads(res.read())
        # 検索ワードが見つからない場合
        if "-1" in json["query"]["pages"]:
            sys.stderr.write("error: page \"%s\" is not found.\n" % (self.query))
            return None

        # 検索ワードがある場合
        # JSONは{'query': {'pages': {'17556': {'revisions': {'*': 本文 ~
        else:
            for page_num in json["query"]["pages"]:
                for revision in json["query"]["pages"][page_num]["revisions"]:
                    return revision["*"]
                    break  # revisonは一つだけで(つまり最新版)を取得

    # 余計な文字を除去
    def RemoveWords(self,content):
        RemoveWordList = ["| ","|","===== "," =====","==== "," ====","=== "," ===","===","== "," ==","***","** ","* ","*"]
        ReplaceWordList = ["<br />","<br>",";",":"]
        RemoveDocList = [r'<ref>(.+)</ref>', r'<ref (.+)</ref>', r'<ref (.+)/>', r'<!-- (.+) -->', r'<!--(.+)-->', r'<!--\n(.+)-->',r'[[画像(.+)]]']
        for mark in RemoveWordList:
            content = content.replace(mark, "")
        for mark in ReplaceWordList:
            content = content.replace(mark, " ")
        for doc in RemoveDocList:
            content = re.sub(doc,'',content)
        return content

# txtを保存
def Savedoc(Word):
    wiki = Wiki()
    wiki.set_query(Word)
    Origin_content = wiki.get_content()
    # print(Origin_content)
    if Origin_content!=None:
        content = wiki.RemoveWords(Origin_content)
        with open(Pass + Word + '.txt', 'w') as f:
            f.write(content.encode('utf_8'))
        # print(content)
        print(Word)


if __name__ == "__main__":
    Pass = "./Wikipedia/"
    Tag_List = ["父の魂", "男一匹ガキ大将", "ハレンチ学園", "光速エスパー", "無法松の一生", "デロリンマン", "アニマル球場", "ワースト", "あらし!三匹", "千年王国", "球速0.25秒!", "ど根性ガエル", "トイレット博士", "ライオンブックスシリーズ", "ジャパッシュ", "侍ジャイアンツ", "荒野の少年イサム", "アストロ球団", "マジンガーZ", "はだしのゲン", "クライムスイーパー", "プレイボール", "包丁人味平", "女だらけ", "ピンク!パンチ!雅", "妖怪ハンター", "サーキットの狼", "ドーベルマン刑事", "1・2のアッホ!!", "温泉ボーイ", "暗黒神話", "東大一直線", "四丁目の怪人くん", "こちら葛飾区亀有公園前派出所", "リングにかけろ", "ホールインワン", "すすめ!!パイレーツ", "ピンボケ写太", "怪艇ポセイドン", "びくびくニャンコ", "コブラ", "キン肉マン", "万年雪のみえる家", "Dr.スランプ", "山崎銀次郎", "ああ一郎", "激!!極虎一家", "3年奇面組", "ひのまる劇場", "フォーエバー神児くん", "キャプテン翼", "キャッツ♥アイ", "ストップ!! ひばりくん!", "ブラック・エンジェルズ", "コマンダー0", "風魔の小次郎", "キックオフ", "ハイスクール!奇面組", "THE ファイター", "コスモス・エンド", "やぶれかぶれ", "よろしくメカドック", "ウイングマン", "シェイプアップ乱", "天地を喰らう", "北斗の拳", "魔少年ビーティー", "銀牙 -流れ星 銀-", "機械戦士ギルファー", "ボギー THE GREAT", "きまぐれオレンジ☆ロード", "とっても少年探検隊", "男坂", "ガクエン情報部H.I.P.", "バオー来訪者", "ドラゴンボール", "シティーハンター", "ついでにとんちんかん", "魁!!男塾", "すもも", "飛ぶ教室", "超機動員ヴァンダー", "聖闘士星矢", "赤龍王", "ターヘルアナ富子", "はなったれBoogie", "メタルK", "サスケ忍伝", "空のキャンバス", "くおん…", "県立海空高校野球部員山下たろーくん", "アカテン教師梨本小鉄", "ジョジョの奇妙な冒険", "魔神竜バリオン", "燃える!お兄さん", "ゴッドサイダー", "プレゼント・フロム LEMON", "ゆうれい小僧がやってきた!", "THE MOMOTAROH", "コスモスストライカー", "BASTARD!! -暗黒の破壊神-", "ジャングルの王者ターちゃん♡", "セコンド", "変幻戦忍アスカ♡", "ろくでなしBLUES", "まじかる☆タルるートくん", "ボクはしたたか君", "恐竜大紀行", "CYBERブルー", "CYBORGじいちゃんG", "SCRAP三太夫", "てんで性悪キューピッド", "とびっきり!", "DRAGON QUEST -ダイの大冒険-", "電影少女", "AT Lady!", "エース!", "花の慶次 -雲のかなたに-", "ひかる!チャチャチャッ!!", "新ジャングルの王者ターちゃん♡", "GP BOY", "蹴撃手マモル", "METAL FINISH", "SLAM DUNK", "珍遊記 -太郎とゆかいな仲間たち-", "てんぎゃん -南方熊楠伝-", "幽☆遊☆白書", "超機動暴発蹴球野郎 リベロの武田", "アウターゾーン", "ペナントレース やまだたいちの奇蹟", "タイムウォーカー零", "天外君の華麗なる悩み", "モンモンモン", "柳生烈風剣連也", "爆発!宇宙クマさんタータ・ベア&菊千代くん", "瑪羅門の家族", "HARELUYA", "ボンボン坂高校演劇部", "SILENT KNIGHT翔", "大相撲刑事", "CHIBI", "究極!!変態仮面", "BØY -ボーイ-", "PSYCHO+", "ファイアスノーの風", "原色超人PAINT MAN", "NINKU -忍空-", "こもれ陽の下で…", "とっても!ラッキーマン", "D・N・A² 〜何処かで失くしたあいつのアイツ〜", "地獄先生ぬ〜べ〜", "超弩級戦士ジャスティス", "BOMBER GIRL", "翠山ポリスギャング", "地獄戦士魔王", "影武者徳川家康", "王様はロバ〜はったり帝国の逆襲〜", "キャプテン翼 ワールドユース編", "るろうに剣心 -明治剣客浪漫譚-", "まんゆうき 〜ばばあとあわれなげぼくたち〜", "うるとら☆イレブン", "奴の名はMARIA", "BAKUDAN", "RASH!!", "みどりのマキバオー", "MIND ASSASSIN", "密♥リターンズ!", "陣内流柔術武闘伝 真島クンすっとばす!!", "元気やでっ", "猛き龍星", "人形草紙あやつり左近", "竜童のシグ", "SHADOW LADY", "モートゥル・コマンドーGUY", "惑星をつぐ者", "レベルE", "水のともだちカッパーマン", "かおす寒鰤屋", "セクシーコマンドー外伝 すごいよ!!マサルさん", "WILD HALF", "幕張", "ダイヤモンド", "K.O.マサトメ", "封神演義", "ドルヒラ", "心理捜査官 草薙葵", "遊☆戯☆王", "魔女娘ViVian", "BE TAKUTO!!〜野蛮なれ〜", "BASTARD!! -暗黒の破壊神-（背徳の掟編）", "花さか天使テンテンくん", "仏ゾーン", "Wrestling with もも子", "Merry Wind", "JOKER", "世紀末リーダー伝たけし!", "ONE PIECE", "COOL - RENTAL BODY GUARD -", "きりん 〜The Last Unicorn〜", "COWA!", "明稜帝 梧桐勢十郎", "ROOKIES", "少年探偵Q", "ホイッスル!", "HUNTER×HUNTER", "シャーマンキング", "カジカ", "ぼくは少年探偵ダン♪♪", "ライジングインパクト", "ヒカルの碁", "邪馬台幻想記", "-蹴球伝-フィールドの狼 FW陣!", "武士沢レシーブ", "サバイビー", "テニスの王子様", "ZOMBIEPOWDER.", "NARUTO -ナルト-", "Romancers", "無頼男 -ブレーメン-", "ツリッキーズピン太郎", "三獣士", "SAND LAND", "ノルマンディーひみつ倶楽部", "BLACK CAT", "カイゼルスパイク", "ロケットでつきぬけろ!", "ピューと吹く!ジャガー", "純情パイン", "りりむキッス", "バカバカしいの!", "GUN BLAZE WEST", "重臣 猪狩虎次郎", "ボボボーボ・ボーボボ", "Mr.FULLSWING", "鴉MAN", "魔術師2", "BLEACH", "グラン・バガン", "サクラテツ対話篇", "あっけら貫刃帖", "いちご100%", "少年エスパーねじめ", "プリティフェイス", "NUMBER10", "アイシールド21", "SWORD BREAKER", "Ultra Red", "グラナダ -究極科学探検隊-", "TATTOO HEARTS", "闇神コウ〜暗闇にドッキリ!〜", "ごっちゃんです!!", "武装錬金", "神奈川磯南風天組", "戦国乱破伝サソリ", "サラブレッドと呼ばないで", "神撫手", "DEATH NOTE", "銀魂", "LIVE", "スティール・ボール・ラン", "未確認少年ゲドー", "無敵鉄姫スピンちゃん", "家庭教師ヒットマンREBORN!", "D.Gray-man", "ワークワーク", "ムヒョとロージーの魔法律相談事務所", "ユート", "魔人探偵脳噛ネウロ", "カイン", "タカヤ -閃武学園激闘伝-", "切法師", "みえるひと", "太臓もて王サーガ", "べしゃり暮らし", "大泥棒ポルタ", "真説ボボボーボ・ボーボボ", "ツギハギ漂流作家", "メゾン・ド・ペンギン", "タカヤ -夜明けの炎刃王-", "謎の村雨くん", "To LOVEる -とらぶる-", "エム×ゼロ", "OVER TIME", "斬", "P2! - let's Play Pingpong! -", "HAND'S -ハンズ-", "BLUE DRAGON ラルΩグラド", "神力契約者M&Y", "重機人間ユンボル", "サムライうさぎ", "バレーボール使い 郷田豪", "ぼくのわたしの勇者学", "瞳のカトブレパス", "ベルモンド Le VisiteuR", "SKET DANCE", "初恋限定。", "PSYREN -サイレン-", "K.O.SEN", "MUDDY", "私立ポセイドン学園高等部", "ぬらりひょんの孫", "バリハケン", "ダブルアーツ", "ヘタッピマンガ研究所R", "トリコ", "どがしかでん!", "バクマン。", "いぬまるだしっ", "チャゲチャ", "アスクレピオス", "マイスター", "黒子のバスケ", "ぼっけさん", "べるぜバブ", "フープメン", "めだかボックス", "AKABOSHI -異聞水滸伝-", "あねどきっ", "鍵人 -カギジン-", "わっしょい!わじマニア", "保健室の死神", "賢い犬リリエンタール", "ねこわっぱ!", "新世紀アイドル伝説 彼方セブンチェンジ", "LOCK ON!", "詭弁学派、四ッ谷先輩の怪談。", "メタリカメタルカ", "少年疾駆", "SWOT", "逢魔ヶ刻動物園", "ǝnígmǝ【エニグマ】", "LIGHT WING", "DOIS SOL", "メルヘン王子グリム", "magico", "戦国ARMORS", "奇怪噺 花咲一休", "ST&RS -スターズ-", "鏡の国の針栖川", "クロガネ", "ニセコイ", "現存!古代生物史パッキー", "ハイキュー!!", "パジャマな彼女。", "恋染紅葉", "斉木楠雄のΨ難", "暗殺教室", "タカマガハラ", "烈!!!伊達先パイ", "クロス・マネジ", "HUNGRY JOKER", "新米婦警キルコさん", "食戟のソーマ", "ワールドトリガー", "SOUL CATCHER(S)", "スモーキーB.B.", "銀河パトロール ジャコ", "HACHI -東京23宮-", "恋のキューピッド 焼野原塵", "磯部磯兵衛物語〜浮世はつらいよ〜", "アイアンナイト", "ILLEGAL RARE", "i・ショウジョ", "火ノ丸相撲", "僕のヒーローアカデミア", "ジュウドウズ", "ハイファイクラスタ", "Sporting Salt", "卓上のアゲハ", "E-ROBOT", "カガミガミ", "ブラッククローバー", "Ultra Battle Satellite", "NARUTO -ナルト- 外伝〜七代目火影と緋色の花つ月〜", "背すじをピン!と〜鹿高競技ダンス部へようこそ〜", "ものの歩", "左門くんはサモナー", "バディストライク", "ゆらぎ荘の幽奈さん", "鬼滅の刃", "BORUTO -ボルト- -NARUTO NEXT GENERATIONS-", "たくあんとバツの日常閻魔帳", "約束のネバーランド", "歪のアマルガム", "青春兵器ナンバーワン", "デモンズプラン", "オレゴラッソ", "ぼくたちは勉強ができない", "ポロの留学記", "Dr.STONE", "ROBOT×LASERBEAM"]
    for Tag in Tag_List:
        Savedoc(Tag)